In [2]:
import pandas as pd

df = pd.read_csv("universities.csv")

df.head(5)

     City                                      Name  Students
0  Krakow  AGH University of Science and Technology     23000
1  Krakow                   Jagiellonian University     24000
2  Krakow           Cracow University of Technology     16000
3  Krakow       University of Agriculture in Krakow     15000
4  Krakow          Pedagogical University of Krakow     12000

In [3]:
df.tail(4)

      City                                       Name  Students
28  Warsaw      University of Life Sciences in Warsaw     14000
29  Warsaw  Warsaw University of Life Sciences (SGGW)     14000
30  Warsaw        Fryderyk Chopin University of Music       500
31  Warsaw             Academy of Fine Arts in Warsaw      2000

In [4]:
df.iloc[:7, 1:]

                                       Name  Students
0  AGH University of Science and Technology     23000
1                   Jagiellonian University     24000
2           Cracow University of Technology     16000
3       University of Agriculture in Krakow     15000
4          Pedagogical University of Krakow     12000
5            Academy of Fine Arts in Krakow      2000
6             University of Music in Krakow       500

In [6]:
df[df['City'] == 'Warsaw']

      City                                            Name  Students
21  Warsaw                            University of Warsaw     56000
22  Warsaw                 Warsaw University of Technology     34000
23  Warsaw                   School of Economics in Warsaw     22000
24  Warsaw                  SGH Warsaw School of Economics     13000
25  Warsaw                    Medical University of Warsaw     12000
26  Warsaw           National Defence University of Warsaw      5000
27  Warsaw  Cardinal Stefan Wyszyński University in Warsaw     12000
28  Warsaw           University of Life Sciences in Warsaw     14000
29  Warsaw       Warsaw University of Life Sciences (SGGW)     14000
30  Warsaw             Fryderyk Chopin University of Music       500
31  Warsaw                  Academy of Fine Arts in Warsaw      2000

In [10]:
df[df['City'] == 'Warsaw']['Name']

21                              University of Warsaw
22                   Warsaw University of Technology
23                     School of Economics in Warsaw
24                    SGH Warsaw School of Economics
25                      Medical University of Warsaw
26             National Defence University of Warsaw
27    Cardinal Stefan Wyszyński University in Warsaw
28             University of Life Sciences in Warsaw
29         Warsaw University of Life Sciences (SGGW)
30               Fryderyk Chopin University of Music
31                    Academy of Fine Arts in Warsaw
Name: Name, dtype: object

In [12]:
df[df['City'] == 'Krakow']['Name'].tail(3)

18    Wyższa Szkoła Informatyki i Zarządzania (WSIiZ)
19            Władysław Szafer Academy of Agriculture
20                    Krakow Teacher Training College
Name: Name, dtype: object